<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2//EN">
<HTML>
<HEAD>
	<META HTTP-EQUIV="CONTENT-TYPE" CONTENT="text/html; charset=utf-8">
	<TITLE>DataExplorer - WStechVario Ger&auml;tedialog</TITLE>
	<META NAME="GENERATOR" CONTENT="OpenOffice.org 2.4  (Win32)">
	<META NAME="CREATED" CONTENT="0;0">
	<META NAME="CHANGEDBY" CONTENT="Winfried Br&uuml;gmann">
	<META NAME="CHANGED" CONTENT="20080718;18455985">
</HEAD>
<BODY LANG="de-DE" DIR="LTR">
<DIV TYPE=HEADER>
	<H2><FONT FACE="Arial"><FONT SIZE=4><I>WStechVario Ger&auml;tedialog</I></FONT></FONT></H2>
</DIV>
<P>Der gezeigte Ger&auml;tedialog dient zur Konfiguration der Anzeige der ausgelesenen Daten.
&Uuml;ber einen Dateiauswahldialog, erreichbar &uuml;ber "&ouml;ffne Datei", k&ouml;nnen auch neue Dateien Eingelesen werden.
</P>
<P ALIGN=CENTER><IMG SRC="HelpInfo_Bild_1.png" NAME="HelpInfo_Bild_1" ALT="HelpInfo_Bild_1">
</P>
<P>Hinweis: Ist die Anzeige erst einmal konfiguriert, wird diese Anzeigekonfiguration auch angewendet, 
wenn über die Kanal/Konfigurations- Auswahl in der Toolbar eine Konfiguration gewählt und dann über "importiere Datei"
in der Toolsleiste der Dateidialog geöffnet und eine Datei eingelesen wird.
</P>

<H3><FONT FACE="Arial"><FONT SIZE=3>Datenexport im KML bzw. GPX Dateiformat</FONT></FONT></H3>
<P>&Uuml;ber das Dateimen&uuml; -> Export k&ouml;nnen GPS basierte Daten, soweit vorhanden, in dem Google Earth KML Datenformat,
sowie dem "global positioning system" (GPS) Austauschformat GPX, exportiert werden.
</BR>
Beide Datenformate lassen sich in der Google Earth Anwendung &ouml;ffnen und betrachten.
Da in der Google Earth Anwendung keine H&ouml;heninformation dargestellt wird der Export immer mit relative H&ouml;he empfohlen.
Das GPX Format bietet den Vorteil, dass hier Wegpunkte selektiert werden k&ouml;nnen und dabei die Höheninformation und Geschwindigkeit angezeigt werden.
Bei einer GPX Datei mit relativer H&ouml;he er&uuml;brigt sich das selektieren von "H&ouml;hen an Bodenh&ouml;he anpassen", was die H&ouml;heninformation des Tracks eliminiert.
</P>
<P ALIGN=CENTER><IMG SRC="HelpInfo_Bild_2.png" NAME="HelpInfo_Bild_2" ALT="HelpInfo_Bild_2">
</P>
<P>Bitte sicherstellen, dass die Masseinheiten wie gezeigt eingestellt sind.
</P>
<P ALIGN=CENTER><IMG SRC="HelpInfo_Bild_3.png" NAME="HelpInfo_Bild_3" ALT="HelpInfo_Bild_3">
</P>
<P>
Bei ausgedehnten Fl&uuml;gen kann man die exportierte Datei manuell in kleinere Einzelst&uuml;cke zerlegen.
Hiermit wird dann die &Uuml;bersichtlichkeit verbessert, bzw. bleibt erhalten.
</P>

<H3><FONT FACE="Arial"><FONT SIZE=3>VarioTool - erstellen von Setupdateien</FONT></FONT></H3>
<P>Dieses Ger&auml;teplug-in enth&auml;lt die Besonderheit eines zus&auml;tzlichen Tabulators im Hauptfenster. 
Hiermit wird die ger&auml;tespezifische Anwendung zur Erstellung der Ger&auml;tesetupdatei abgebildet und steht dadurch für alle, durch diese Anwendung unterstützen Betriebssysteme, zur Verf&uuml;gung.
Der Tabulator wird automatisch beim Umschalten auf das Ger&auml;t angelegt, bzw. geschlossen. 
Als Beispiel sei hier der Tabulator f&uuml;r das LinkVario gezeigt. 
Der Tabulatorinhalt ist für das DataVario ist entsprechend angepasst. 
</P>
<P ALIGN=CENTER><IMG SRC="HelpInfo_Bild_4.png" NAME="HelpInfo_Bild_4" ALT="HelpInfo_Bild_4 Ger&auml;te speziefisches Konfigurationswerkzeug">
</P>
<P>Das Laden bzw. Speichern der Setup- oder Konfigurations-Datei geschieht &uuml;ber das Kontextmen&uuml;.
</P>
</P>
<P ALIGN=CENTER><IMG SRC="HelpInfo_Bild_5.png" NAME="HelpInfo_Bild_5" ALT="HelpInfo_Bild_5 - Kontextmen%uuml; - laden und speichern der Konfiguraitonsdatei">
</P>
</BODY>
</HTML>