<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2//EN">
<HTML>
<HEAD>
<META HTTP-EQUIV="CONTENT-TYPE" CONTENT="text/html; charset=utf-8">
<TITLE>DataExplorer - Information und Hilfe</TITLE>
<META NAME="AUTHOR" CONTENT="Winfried Brügmann">
<LINK HREF="../HelpInfo.css" REL="STYLESHEET" TYPE="text/css">
</HEAD>
<BODY LANG="de-DE" DIR="LTR">
<DIV ID="Header">DataExplorer&nbsp;&nbsp;-&nbsp;&nbsp;Information und Hilfe</DIV>

<DIV ID="Menu"><A HREF="HelpInfo.html">Information und Hilfe</A></BR>
</BR>
&nbsp;&nbsp;<A HREF="HelpInfo.html">Einleitung</A> </BR>
&nbsp;&nbsp;&nbsp;&nbsp;<A HREF="HelpInfo_01.html">Verwendete Verzeichnisse</A> </BR>
&nbsp;&nbsp;&nbsp;&nbsp;<A HREF="HelpInfo_02.html">Das Anwendungsfenster</A> </BR>
</BR>
&nbsp;&nbsp;<A HREF="HelpInfo_1.html">Der Einstellungsdialog</A> </BR>
</BR>
&nbsp;&nbsp;<A HREF="HelpInfo_2.html">Der Geräteauswahldialog</A> </BR>
</BR>
&nbsp;&nbsp;<A HREF="HelpInfo_3.html">Menü- und Tool- Bar</A> </BR>
&nbsp;&nbsp;&nbsp;&nbsp;<A HREF="HelpInfo_3.html">"Datei"</A> </BR>
&nbsp;&nbsp;&nbsp;&nbsp;<A HREF="HelpInfo_31.html">"Bearbeiten"</A> </BR>
&nbsp;&nbsp;&nbsp;&nbsp;<A HREF="HelpInfo_32.html">"Gerät"</A> </BR>
&nbsp;&nbsp;&nbsp;&nbsp;<A HREF="HelpInfo_33.html">"Grafikvorlagen"</A> </BR>
&nbsp;&nbsp;&nbsp;&nbsp;<A HREF="HelpInfo_34.html">"Ansicht"</A> </BR>
&nbsp;&nbsp;&nbsp;&nbsp;<A HREF="HelpInfo_34.html">"Hilfe"</A> </BR>
&nbsp;&nbsp;&nbsp;&nbsp;<A HREF="HelpInfo_35.html">Kanalwahl-ToolBar</A> </BR>
&nbsp;&nbsp;&nbsp;&nbsp;<A HREF="HelpInfo_35.html">Konfigurationswahl-ToolBar</A> </BR>
&nbsp;&nbsp;&nbsp;&nbsp;<A HREF="HelpInfo_35.html">Datensatzauswahl-ToolBar</A> </BR>
</BR>
&nbsp;&nbsp;<A HREF="HelpInfo_4.html">Grafische Anzeige</A> </BR>
&nbsp;&nbsp;&nbsp;&nbsp;<A HREF="HelpInfo_41.html">Der Kurvenselektor</A></BR>
&nbsp;&nbsp;&nbsp;&nbsp;<A HREF="HelpInfo_42.html">Zoomen und Positionieren</A> </BR>
</BR>
&nbsp;&nbsp;<A HREF="HelpInfo_5.html">Statistik Anzeige</A> </BR>
</BR>
&nbsp;&nbsp;<A HREF="HelpInfo_6.html">Tabellarisches Anzeige</A> </BR>
</BR>
&nbsp;&nbsp;<A HREF="HelpInfo_7.html">Digitale Anzeige</A> </BR>
</BR>
&nbsp;&nbsp;<A HREF="HelpInfo_8.html">Analoge Anzeige</A> </BR>
</BR>
&nbsp;&nbsp;<A HREF="HelpInfo_9.html">Zellenspannung Anzeige</A> </BR>
</BR>
&nbsp;&nbsp;<A HREF="HelpInfo_91.html">Kurvenvergleich Anzeige</A> </BR>
</BR>
&nbsp;&nbsp;<A HREF="HelpInfo_92.html">Datei-Kommentar</A> </BR>
&nbsp;&nbsp;<A HREF="HelpInfo_92.html">Datensatz-Kommentar</A> </BR>
</BR>
&nbsp;&nbsp;<A HREF="HelpInfo_93.html">Objektcharakteristik</A> </BR>
</BR>
<A HREF="HelpInfo_A.html">Gerätekonfigurationsdateien</A> </BR>
&nbsp;&nbsp;&nbsp;&nbsp;<A HREF="HelpInfo_A1.html">Ger&auml;teeigenschafteneditor</A> </BR>
</BR>
<A HREF="HelpInfo_B.html">Dateiformat</A></BR>
</BR>
<A HREF="HelpInfo_C.html">CSV2SerialAdapter Datenformat</A>
</DIV>

<DIV ID="Content" DIR="LTR">
<H2><A NAME="device_properties_edit"></A>Ger&auml;teeigenschafteneditor</H2>
<P>&Uuml;ber das Ger&auml;temen&uuml; oder als eigenst&auml;ndige Anwendung aufgerufen lassen sich neue oder vorhandene Ger&auml;teeigenschaftendateien erstellen oder anpassen.
Hiermit werden die Ger&auml;te XML Dateien ver&auml;ndert.
<IMG SRC="images/DevicePropsEditor_MenuBar.png" NAME="DevicePropsEditor_MenuBar" ALIGN=RIGHT>
</P>
<P>
&Uuml;ber das Men&uuml; kann eine Ger&auml;tedatei direkt ge&ouml;ffnet werden.
Ist das der Fall, wird die Ger&auml;tedatei des aktuellen Ger&auml;tes geladen und ein &Auml;ndern der Datei ist m&ouml;glich, wobei nit alle Eigenschaften direkt auf existierende Daten wirken.
Wird der DevicePropertiesEditor als eigene Anwendung gestartet kann der Name, falls bekannt kann auch direkt eingegeben werden. Ist der Name der Datei nicht im Ger&auml;teordner enthalten, geht die Anwendung davon aus das eine neue Ger&auml;tedatei angelegt werden soll und fragt danach.
</BR></BR>
<IMG SRC="images/DevicePropsEditor_NewDevice.png" NAME="DevicePropsEditor_NewDevice" ALIGN=LEFT>
</BR></BR></BR></BR></BR></BR></BR>
Hierbei wird dann eine Beispieldatei extrahiert, die dann angepasst werden kann.
Durch Selektion des Knopfes auf der rechten Seite, kann &uuml;ber einen Dateiauswahldialog die Ger&auml;tedatei ge&ouml;ffnet werden.
</P>
<P ALIGN=CENTER><IMG SRC="images/DevicePropsEditor_Device.png" NAME="DevicePropsEditor_Device" ALIGN=MIDDLE></P>
<P>
Der Ger&auml;t Tabulator zeigt wie man Name und Herstellerangaben eintr&auml;gt.
</P>
<P>
Schaltet man die Implementierung aktiv, muss hier die Ger&auml;teklasse als Klassenname oder mit package.Klassenname, als voll qualifiziert, eingetragen werden. 
Eine Implementierung kann immer dann verwendet werden, wenn ein Ger&auml;t schon implementiert ist, nur der Name nicht passt. 
Als Beispiel soll hier der CSV2SerialAdapter genannt werden, Unterschiede bestehen nur in der Spezifikation des Datentextblocks.
Als weiteres Beispiel k&ouml;nnen die vielen Kopien der Bantam Ladeger&auml;te herangezogen werden, die sich im Aussehen und Namen unterscheiden. 
Hier m&ouml;chte man die Daten doch unter seinem Ger&auml;tenamen abgelegt vorfinden.
<IMG SRC="images/DevicePropsEditor_Implementation.png" NAME="DevicePropsEditor_Implementation" ALIGN=MIDDLE>
</BR>Gibt man das 'package' nicht an beginnt das 'package' immer mit "osde.device.", gefolgt vom Namen des Herstellers in Kleinbuchstaben umgewandelt, wobei Leerzeichen sowie Bindestriche entfernt werden.
Aus dem Ger&auml;tenamen wird der Klassenname ebenfalls durch entfernen von Leerzeichen und Bindestrichen berechnet. 
Die Gro&szlig;-, Klein-Schreibung wird f&uuml;r den Klassennamen allerdings beibehalten.
<P>
Der Bildname kann von Hand eingegeben werden, falls auf ein, im Ger&auml;te Plug-in, vorhandenes Bild in der Ger&auml;teauswahl angezeigt werden soll.
Wird &uuml;ber den Knopf auf der rechten Seite eine Bilddatei ausgew&auml;hlt, wird diese sofort auf die erforderliche Gr&ouml;&szlig;e (225x165) skaliert.
Hierbei wird auch angeboten, die Bilddatei sofort in das Ger&auml;te Plug-in einzupacken. 
Dies kann aber nur in einem tempor&auml;ren Ordner geschehen, da nur hier Schreibrechte garantiert sind. 
Gegebenenfalls muss sp&auml;ter das Plug-in in den Anwendungsordner kopiert werden.
<IMG SRC="images/DevicePropsEditor_Image.png" NAME="DevicePropsEditor_Image" ALIGN=MIDDLE>
</BR>Genaue Anweisungen, wo sich das modifizierte Plug-in befindet und wo es auszutauschen ist, werden als Messagebox angezeigt.
<P><B>Hinweis : </B>Diese &Auml;nderung geht bei einem Anwendungsupdate verloren.
Gegebenenfalls selbst für eine Sicherung sorgen.</P>
</P>
</P>
<P><A NAME="device_properties_serial_port"></A>
<IMG SRC="images/DevicePropsEditor_SerialPort.png" NAME="DevicePropsEditor_SerialPort" ALIGN=RIGHT>
F&uuml;r den seriellen Port sind die entsprechenden Konfigurationsparameter einzutragen.
Da hier alle Auswahlm&ouml;glichkeiten &uuml;ber Auswahldialoge eingestellt werden sind weitere Hinweise nicht n&ouml;tig.
<P><B>Hinweis : </B>Werden Timeoutzeiten angegeben muss die Implementierung so geschrieben sein, dass diese auch benutzt werden.
</BR>
Die Beschreibung der seriellen Schnittstelle ist optional, weil es Ger&auml;te gibt, die einen virtuellen seriellen Input &uuml;ber Textdaten erhalten.
Beispielsweise haben Ger&auml;te die das CSV2SerialAdapter Plug-in benutzen keine serielle Schnittstelle. 
</P>
</P>
</BR></BR></BR></BR></BR></BR></BR></BR></BR></BR></BR></BR></BR></BR></BR></BR></BR></BR></BR>
<P>
<IMG SRC="images/DevicePropsEditor_TimeBase.png" NAME="DevicePropsEditor_TimeBase" ALIGN=RIGHT>
Die Zeitbasis zu konfigurieren ist einfach. 
</BR>
Ein Wert gr&ouml;&szlig;er 0 Millisekunden als Zeitabstand zwischen den Messpunkten wird als konstanter Zeitabstand angenommen. 
Bei einem Zeitwert kleiner 0 Millisekunden, wird davon ausgegangen, dass das Ger&auml;t die Zeit vorgibt. Das muss nicht hei&szlig;en, dass der Abstand zwischen den Messpunkten konstant ist.
Vorrangig muss hier die Ger&auml;teimplementierung das Richtige daraus machen.
</P>
<P><B>Hinweis : </B>Das UniLog, als Beispiel, hat einen einstellbaren und damit ver&auml;nderlichen aber konstanten Zeitabstand zwischen den Messpunkten.
Damit ist f&uuml;r die Zeitbasis -1 einzustellen.
Schlussendlich muss aber auch hier die Ger&auml;teimplementierung f&uuml;r das richtige Verhalten sorgen, den Zeitwert bei jedem Auslesevorgang von Daten ermitteln und f&uuml;r diesen Datensatz konstant verwenden.
</P>
</BR></BR></BR></BR></BR></BR></BR></BR></BR></BR></BR></BR></BR></BR></BR></BR></BR></BR></BR>
<P><A NAME="device_properties_datablock"></A>
Hier werden 2 verschiedene Datenblockkonfigurationen gegen&uuml;bergestellt. 
Die UniLog Konfiguration beschreibt bin&auml;re Daten der konstanten Gr&ouml;&szlig;e von 24 Byte.
Sollte die maximale Anzahl von Datenbytes 24 betragen, k&ouml;nnen als auch mal nur z.B. 20 Bytes zur Verf&uuml;gung stehen, m&uuml;sste hier -24 eingetragen werden.
Dadurch, dass als Datentyp BINARY gew&auml;hlt ist k&ouml;nnen auch keine Trennzeichen eingegeben werden.
<IMG SRC="images/DevicePropsEditor_DataBlock1.png" NAME="DevicePropsEditor_DataBlock1" ALIGN=LEFT>
<IMG SRC="images/DevicePropsEditor_DataBlock2.png" NAME="DevicePropsEditor_DataBlock2" ALIGN=RIGHT>
</BR></BR></BR></BR></BR></BR></BR></BR></BR></BR></BR></BR></BR></BR></BR></BR></BR></BR></BR></BR></BR></BR></BR></BR></BR></BR>
Ist als Datentype TEXT gew&auml;hlt m&uuml;ssen zus&auml;tzliche Konfigurationsdaten angegeben werden, die zum verwerten der Daten ben&ouml;tigt werden.
Interessant sind auch die Dateiendung, die die Dateisuche einschr&auml;nkt, sowie der Dateipfad, der ein Standardverzeichnis spezifiziert, wo die Daten erwartet werden.
Beides sind optionale Angaben, helfen aber, wenn Daten, wie bei dem DataVario von WStech auf einer Speicherkarte angeliefert werden, die beim einstecken in den Computer einen bestimmten Laufwerkspfad annimmt.
<P><B>Hinweis : </B>Auch diese Konfiguration ist optional, die individuelle Ger&auml;teimplementierung k&ouml;nnte das alles behandeln.</P>
</P>
</BR></BR></BR></BR></BR></BR></BR></BR></BR></BR></BR></BR>
<P><A NAME="device_properties_state"></A>
<IMG SRC="images/DevicePropsEditor_State.png" NAME="DevicePropsEditor_State" ALIGN=RIGHT>
Auf der Zustand-Tabulatorseite werden optional die Zust&auml;nde beschrieben, die ein Ger&auml;t einnehmen kann.
Diese Beschreibung macht haupts&auml;chlich Sinn, wenn ein Ger&auml;t mehr wie einen Zustand einnehmen kann oder die Daten &uuml;ber eine Textdatei (CSV2SerialDataAdapter) eingelesen werden. 
Die Ger&auml;teimplementierung bestimmt wie die sequenziell angeordneten Zust&auml;nde anzuwenden sind.
<P><B>Hinweis : </B>Werden die Daten &uuml;ber eine Textdatei (CSV2SerialDataAdapter) eingelesen, so wird als Zustand 1, wie abgebildet Laden ($1;1;Zeit;Daten;..), und als Zustand 2 Entladen ($1;2;Zeit;Daten;..) verwendet.</P>
</P>
</BR></BR></BR></BR></BR></BR></BR></BR></BR></BR></BR></BR></BR></BR></BR></BR></BR></BR></BR>
<P><A NAME="device_properties_channelConfig"></A>
<IMG SRC="images/DevicePropsEditor_ChannelConfig.png" NAME="DevicePropsEditor_Config" ALIGN=RIGHT>
Die Tabulator mit der Beschriftung "Ausgangskanal/Konfiguration" ist die komplizierteste und umfangreichste Konfigurationsseite.
Hier werden, wenn erwünscht oder nötig, die Ausg&auml;nge von einem Ger&auml;t (entsprechen einem Datenkanal) beschreiben oder eben verschiedene Konfigurationen, die auf die Datens&auml;tze angewendet werden sollen.
Es gibt also, wie beschrieben, 2 Kanal-Konfigurationstypen, zwischen den entschieden werden muss. 
Bei einem Ladeger&auml;t, an dem zu einer Zeit nur ein Akku geladen werden kann, hat auch nur einen Ausgang, an dem der Akku angeschlossen wird.
Es wird auch nur ein Ausgang als Datenkanal beschrieben. Das ist in nebenstehenden Beispiel beschrieben.
</BR>
Unterhalb der Leiste, &uuml;ber die man den Type und den Namen der Kanal-Konfiguration ausw&auml;hlen kann, befindet sich der Tabulatorbereich, der die einzelnen Messwerte beschreibt.
Die Messwertbeschreibung und Konfiguration bestimmt deren Anzeige einschlie&szlig;lich der Einheitenberechnung, sowie nimmt Einfluss auf die statistische Auswertung.
</BR>
<B>Hinweis : </B>W&auml;hlt man Konfiguration (TYPE_CONFIG) als Type k&ouml;nnen unterschiedliche Konfigurationen auf ein und dieselben Daten angewendet werden. 
</BR>
Möchte man Kanal/Konfigurationen kopieren, um sie zu vervielf&auml;ltigen ist es sinnvoll die zugeh&ouml;rigen Messwerte und deren Beschreibungen vorher zu vervollst&auml;ndigen.
</P>
</P>
</BR></BR></BR></BR></BR></BR></BR></BR></BR></BR></BR></BR>
<P><A NAME="device_properties_measurement"></A>
<IMG SRC="images/DevicePropsEditor_MeasurementProperty.png" NAME="DevicePropsEditor_MeasurementProperty" ALIGN=RIGHT>
Messwerte beschreibt man mit dem Namen, welche Einheit sie besitzen, welche Symbol verwendet werden soll und  ob sie aktiv aus dem Ger&auml;t ausgelesen werden k&ouml;nnen, oder ob sie durch Berechnung entstehen.
Des weiteren gibt es optionale Eigenschaften, z.B. &uuml;ber Faktor, Offset und Reduktion die Anzeige der (Roh-)Daten beeinflussen.
<P><B>Hinweis : </B>Ben&ouml;tigt man weitere Eigenschaften oder Statisikeinstellungen kann man diese durch das Kontextmen&uuml; anfordern.
Nach der Vervollst&auml;ndigung kann man dann die gerade fertiggestellte Messwertkonfiguration in eine Neue, durch Selektion des +Knopfes, kopieren.
</BR></BR>
Zu den Eigenschaften (Properties) ist wenig zu sagen, da hier nur vorbestimmte ausgew&auml;hlt werden k&ouml;nnen und nur noch der Wert entsprechend anzupassen ist.
</P>
</P>
</BR></BR></BR></BR></BR></BR></BR></BR></BR></BR></BR></BR></BR></BR></BR></BR></BR>
<P><A NAME="device_properties_statistics"></A>
<IMG SRC="images/DevicePropsEditor_MeasurementStatisitcs1.png" NAME="DevicePropsEditor_MeasurementStatisitcs1" ALIGN=RIGHT>
Hier wird ein Statistikbeispiel gezeigt, das nicht nur die zu berechnenden Werte beschreibt, sondern auch einen Schwellwert (Trigger) , der &uuml;ber Gr&ouml;&szlig;e und Zeit einen Auswertebereich festlegt.
Au&szlig;erdem wird bestimmt, dass die Zeit, an der der eingestellte Schwellwert wirksam wird, aufsummiert werden soll. Hieraus kann dann, wie im Beispiel, die wirkliche Motorlaufzeit berechnet werden.
Zus&auml;tzlich wird eingestellt, dass die Anzahl der Ereignisse gez&auml;hlt werden soll.
<P><B>Hinweis : </B>Zu den meisten Schwellwert bezogenen Einstellungen gibt es die M&ouml;glichkeit Kommentare hinzuzuf&uuml;gen. Das ist für die Lesbarkeit von gro&szlig;em Vorteil (<A HREF="HelpInfo_5.html">Statistik Anzeige</A>).</P>
</P>
</BR></BR></BR></BR></BR></BR></BR></BR></BR></BR></BR></BR></BR></BR></BR></BR></BR></BR></BR>
<P>
<IMG SRC="images/DevicePropsEditor_MeasurementStatisitcs2.png" NAME="DevicePropsEditor_MeasurementStatisitcs2" ALIGN=RIGHT>
Hier wird gezeigt, wie die Auswertung eines anderen Messwertes durch einen bereits definierten Schwellwert (Trigger) beeinflusst werden kann.
In dem gezeigten Beispiel wird durch die Anwahl von "sumByTriggerRef" ausschlie&szlig;lich die H&ouml;he aufsummiert, die im definierten Schwellwert gewonnen wurde.
Jetzt zeigt sich wie gut eine Luftschrauben-, Motor-Anpassung vorgenommen wurde, beziehungsweise es lassen sich jetzt wirkliche nachvollziehbare Vergleiche anstellen.
</BR>
Zus&auml;tzlich wird hier gezeigt, wie hier eine Verh&auml;ltnism&auml;&szlig;igkeit gebildet werden kann, die ein Verh&auml;ltnis der verbrauchten Akkukapazit&auml;t zur erreichten H&ouml;he darstellt.
Auch das erlaubt gewisse Aussagen &uuml;ber die Anpassung der zur Verf&uuml;gung stehenden Leistung zur Ausgenutzten.
<P><B>Hinweis : </B>Weitere Konfigurationsbeispiele findet man beim UniLog oder DataVario.</P>
</P>
</BR></BR></BR></BR></BR></BR></BR></BR></BR></BR></BR></BR></BR></BR></BR></BR></BR>
<P>
<IMG SRC="images/DevicePropsEditor_Desktop.png" NAME="DevicePropsEditor_Desktop" ALIGN=RIGHT>
Als letzte fehlt noch die Beschreibung, was mit der Desktopkonfiguration gemeint ist.
Hier wird initial konfiguriert, welcher Anzeigetabulator aktiv geschaltet werden soll. 
Aktiv bezieht sich auf die Sichtbarkeit selbst, sowie auf den Zeitbedarf, der zur eigentlichen Anzeige, der auf dem Tabulatorfenster befindlichen Daten, verbraucht wird.
<P><B>Hinweis : </B>Initiale Konfiguration meint, dass &uuml;ber die DataExplorer Anwendung selbst, im <A HREF="HelpInfo_2.html#device_selection_desktop">Ger&auml;teauswahldialog</A>, diese Konfiguration beeinflusst wird.</P>
</P>
</BR></BR></BR></BR></BR></BR></BR></BR></BR></BR></BR></BR></BR></BR></BR></BR></BR></BR></BR>
<P ALIGN=LEFT><A HREF="HelpInfo_A.html">&lt;&lt;== zur&uuml;ck</A></P>
<P ALIGN=RIGHT><A HREF="HelpInfo_B.html">weiter ==&gt;&gt;</A></P>
</DIV>
</BODY>
</HTML>
