<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2//EN">
<!-- 
*************************************************************************************
  	This file is part of GNU DataExplorer.

    GNU DataExplorer is free software: you can redistribute it and/or modify
    it under the terms of the GNU General Public License as published by
    the Free Software Foundation, either version 3 of the License, or
    (at your option) any later version.

    GNU DataExplorer is distributed in the hope that it will be useful,
    but WITHOUT ANY WARRANTY; without even the implied warranty of
    MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
    GNU General Public License for more details.

    You should have received a copy of the GNU General Public License
    along with GNU DataExplorer.  If not, see <http://www.gnu.org/licenses/>.
    
    Copyright (c) 2008,2009,2010,2011,2012 Winfried Bruegmann
************************************************************************************** 
-->
<HTML>
<HEAD>
<META HTTP-EQUIV="CONTENT-TYPE" CONTENT="text/html; charset=utf-8">
<TITLE>DataExplorer - Information und Hilfe</TITLE>
<META NAME="AUTHOR" CONTENT="Winfried Brügmann">
<LINK HREF="../HelpInfo.css" REL="STYLESHEET" TYPE="text/css">
</HEAD>
<BODY LANG="de-DE" DIR="LTR">
<DIV ID="Header">DataExplorer&nbsp;&nbsp;-&nbsp;&nbsp;Information und Hilfe</DIV>

<DIV ID="Menu"><A HREF="HelpInfo.html">Information und Hilfe</A></BR>
</BR>
&nbsp;&nbsp;<A HREF="HelpInfo.html">Einleitung</A> </BR>
&nbsp;&nbsp;&nbsp;&nbsp;<A HREF="HelpInfo_01.html">Verwendete Verzeichnisse</A> </BR>
&nbsp;&nbsp;&nbsp;&nbsp;<A HREF="HelpInfo_02.html">Das Anwendungsfenster</A> </BR>
</BR>
&nbsp;&nbsp;<A HREF="HelpInfo_1.html">Der Einstellungsdialog</A> </BR>
</BR>
&nbsp;&nbsp;<A HREF="HelpInfo_2.html">Der Geräteauswahldialog</A> </BR>
</BR>
&nbsp;&nbsp;<A HREF="HelpInfo_3.html">Menü- und Tool- Bar</A> </BR>
&nbsp;&nbsp;&nbsp;&nbsp;<A HREF="HelpInfo_3.html">"Datei"</A> </BR>
&nbsp;&nbsp;&nbsp;&nbsp;<A HREF="HelpInfo_31.html">"Bearbeiten"</A> </BR>
&nbsp;&nbsp;&nbsp;&nbsp;<A HREF="HelpInfo_32.html">"Gerät"</A> </BR>
&nbsp;&nbsp;&nbsp;&nbsp;<A HREF="HelpInfo_33.html">"Grafikvorlagen"</A> </BR>
&nbsp;&nbsp;&nbsp;&nbsp;<A HREF="HelpInfo_34.html">"Ansicht"</A> </BR>
&nbsp;&nbsp;&nbsp;&nbsp;<A HREF="HelpInfo_34.html">"Hilfe"</A> </BR>
&nbsp;&nbsp;&nbsp;&nbsp;<A HREF="HelpInfo_35.html">Ausgangswahl-ToolBar</A> </BR>
&nbsp;&nbsp;&nbsp;&nbsp;<A HREF="HelpInfo_35.html">Konfigurationswahl-ToolBar</A> </BR>
&nbsp;&nbsp;&nbsp;&nbsp;<A HREF="HelpInfo_35.html">Datensatzauswahl-ToolBar</A> </BR>
&nbsp;&nbsp;&nbsp;&nbsp;<A HREF="HelpInfo_36.html">Google Earth</A> </BR>
&nbsp;&nbsp;&nbsp;&nbsp;<A HREF="HelpInfo_37.html">IGC Format</A> </BR>
</BR>
&nbsp;&nbsp;<A HREF="HelpInfo_4.html">Grafische Anzeige</A> </BR>
&nbsp;&nbsp;&nbsp;&nbsp;<A HREF="HelpInfo_41.html">Der Kurvenselektor</A></BR>
&nbsp;&nbsp;&nbsp;&nbsp;<A HREF="HelpInfo_42.html">Zoomen und Positionieren</A> </BR>
</BR>
&nbsp;&nbsp;<A HREF="HelpInfo_5.html">Statistik Anzeige</A> </BR>
</BR>
&nbsp;&nbsp;<A HREF="HelpInfo_6.html">Tabellarisches Anzeige</A> </BR>
</BR>
&nbsp;&nbsp;<A HREF="HelpInfo_7.html">Digitale Anzeige</A> </BR>
</BR>
&nbsp;&nbsp;<A HREF="HelpInfo_8.html">Analoge Anzeige</A> </BR>
</BR>
&nbsp;&nbsp;<A HREF="HelpInfo_9.html">Zellenspannung Anzeige</A> </BR>
</BR>
&nbsp;&nbsp;<A HREF="HelpInfo_91.html">Kurvenvergleich Anzeige</A> </BR>
</BR>
&nbsp;&nbsp;<A HREF="HelpInfo_92.html">Datei-Kommentar</A> </BR>
&nbsp;&nbsp;<A HREF="HelpInfo_92.html">Datensatz-Kommentar</A> </BR>
</BR>
&nbsp;&nbsp;<A HREF="HelpInfo_93.html">Objektcharakteristik</A> </BR>
</BR>
<A HREF="HelpInfo_A.html">Gerätekonfigurationsdateien</A> </BR>
&nbsp;&nbsp;&nbsp;&nbsp;<A HREF="HelpInfo_A1.html">Ger&auml;teeigenschafteneditor</A> </BR>
</BR>
<A HREF="HelpInfo_B.html">Dateiformat</A></BR>
</BR>
<A HREF="HelpInfo_C.html">CSV2SerialAdapter Datenformat</A>
</DIV>

<DIV ID="Content" DIR="LTR">
<H1><A NAME="settings"></A>Der Einstellungsdialog</H1>
<P>Der Einstellungsdialog dient zum Einstellen:
<UL>
	<LI>Des Datenpfades, das Verzeichnis unter dem die
	ger&auml;tespezifischen Logdatendateien abgelegt werden sollen, hier
	sucht das Programm entsprechend dem eingestellten Ger&auml;t die
	Datendateien, sowie die Objektdatendateilinks.
	</LI>
	<LI>der Dateisicherungsdialog kann als Anfangsdateiname das
	aktuelle Datum und/oder einen Objektschl&uuml;ssel vorschlagen. Das erleichtert die Auffindbarkeit von Dateien.
	</LI>
	<LI>Verhalten der Ger&auml;tedialoge: Ein programmmodales
	Verhalten ist manchmal unpraktisch, wenn man parallel zu einer
	Datensammelaktion Einstellungen vornehmen m&ouml;chte.
	</LI>
	<LI>Des Dezimalseparator- und Listenseparator-Zeichens, anders als
	durch die Systemlokalen vorgegeben kann man hier Einstellungen
	vornehmen um mit eventuell verwendeten Tabellenkalkulationsprogrammen
	eine Zusammenarbeiten herzustellen. Diese Einstellung wirkt sich auch
	auf den Export, bzw. Import von CSV Dateien, nicht aber die durch den <A HREF="HelpInfo_C.html">CSV2SerialAdapter Datenformat</A> ausgewerteten, aus.
	</LI>
<P align=center><IMG SRC="images/SettingsDialog_1.png" NAME="SettingsDialog_1" ALIGN=CENTER></P>
	<LI>Mit Black-List- bzw. White-List- Einstellungen kann man sein pers&ouml;nliches System, in Bezug auf problematisch Ports, konfigurieren.
	Diese Einstellungen gelten dann auch für den Ger&auml;teauswahldialog.
	Die Ausschlussliste ignoriert darin angegebene Ports, w&auml;hrend die Exklusivliste die aufgelisteten Ports ausschlie&szlig;lich anspricht.
	Hier kann es aber, bei wechselnden Ports durch "Plug And Play" dazu kommen, dass die konfigurierten Ports nicht mehr in der Auswahl erscheinen, da sie vom System automatisch umkonfiguriert wurden.
	</LI>
	<LI>Wird ein globaler serieller Port ausgew&auml;hlt sucht der Dialog automatisch nach
	verf&uuml;gbaren seriellen Anschl&uuml;ssen und blendet das Ergebnis
	m&ouml;glicherweise etwas zeitverz&ouml;gert ein. Diese
	Zeitverz&ouml;gerung kann man auf langsamen Windows basierten Systemen
	reduzieren, in dem man die Verf&uuml;gbarkeitsabfrage abschaltet. Dann
	werden belegte Ports halt auch angezeigt und k&ouml;nnen eventuell
	sp&auml;ter nicht benutzt werden. Der serielle Port kann daf&uuml;r
	aber f&uuml;r das Ger&auml;t gesichert werden. Auf UNIX basierten
	Systemen spielt das, zeitlich gesehen, keinen Rolle. Diese Einstellung
	wirkt sich auch auf den Ger&auml;teauswahldialog aus, der seinerseits
	auch nach verf&uuml;gbaren serielle Ports sucht.
	</BR><B>Hinweis: </B>Bei Windows werden Bluetooth-Ports ausgeblendet, es kommt hier mit dem verwendeten RXTXcomm Paket zu Funktionseinschr&auml;nkungen!
	</LI>
	<LI>wenn es systemweit nur einen seriellen Anschluss (Port) gibt,
	kann man hier die globale Einstellung vornehmen, meist sucht sich das
	Programm aber selbst den seriellen Port zur Ger&auml;tekommunikation.
	Der Dialog sucht beim &Ouml;ffnen nach seriellen Anschl&uuml;ssen und
	blendet das Ergebnis m&ouml;glicherweise etwas zeitverz&ouml;gert ein.
	Diese Einstellung wirkt sich auch auf den Ger&auml;teauswahldialog aus,
	der dann die Portauswahl sperrt.
	</LI>
</UL>
</P>
<P>Über den Tabulator "Wartung" kann man das Desktop-Starter-Icon erneut erstellen, bzw. entfernen.
Ebenso kann hier die DataExplorer MIME Typ Assoziation zu den Dateiendungen *.osd und *.lov registriert, bzw. entfernt werden.
F&uuml;r MAC OS wird das nicht unterst&uuml;tzt, bzw. ist es unnötig.
</P>
<P align=center><IMG SRC="images/SettingsDialog_2.png" NAME="SettingsDialog_2" ALIGN=CENTER></P>
<P>Die Taste "Erstelle Linkdateien" erzeugt von allen OSD Dateien die dazugehörigen, fehlenden Objektverzeichnisse und Linkdateien zu den jeweiligen Datendateien.
Die Taste "L&ouml;sche Linkdateien" löscht alle Linkdateien in den Objektverzeichnissen aber nicht die Verzeichnisse und Objektbeschreibungen.
Nicht verändert werden dabei die Dateien, die die Objektbeschreibung enthält. 
Beide Funktionen sind sehr praktisch, wenn man Anwendungsdatendateien auf eine andere Ausf&uuml;hrungsplattform umziehen oder sichern möchte.
</BR>
%Uuml;ber die Taste "Resourcenverbrauch" wird in die aktuelle trace.log Datei die Anzahl von Betriebssystemhandles für die einzelnen verwendeten Programmobjekte geschrieben.
</BR>
Durch drücken der Taste "L&ouml;sche Konfiguration" wird der DataExplorer so konfiguriert, dass er beim Beenden s&auml;mtliche Konfigurationsdateien, falls vorhanden Betriebssystemeintr&auml;ge 
und Starter-Icon entfernt. Danach kann die Anwendung spurenfrei entfernt oder durch Neustart initial konfiguriert werden.
</P>
<P>Über den Analyse Tabulator erreicht man Einstellmöglichkeiten für
eine Fehleranalyse. Nach einem Programmabsturz sollte in einer trace.log
Datei eine m&ouml;gliche Erkl&auml;rung zu finden sein. Achtung, alle
Verstellungen der Loglevel haben einen Einfluss auf die Laufzeit und das
kann zu nicht absehbaren Nebeneffekten f&uuml;hren. Alle Einstellungen
sollten mit diesem Wissen vorgenommen werden. Die Werte sind
entsprechend der Informationsf&uuml;lle gestaffelt, 
<UL>
	<LI>SEVERE schreibt nur Programmfehler,
	<LI>WARNING schreibt Fehler und Warnungen,(ist die Normaleinstellung)
	<LI>TIME schreibt Fehler, Warnungen und Ausf&uuml;hrungszeiten
	<LI>INFO schreibt Fehler, Warnungen, Zeit und Informationen 
	<LI>FINE schreibt Fehler, Warnungen, Zeit, Informationen und Logs des Levels FINE
	<LI>FINER schreibt noch mehr als FINE
	<LI>FINEST schreibt noch mehr als FINER
</UL>
</P>
<P>Der untere Abschnitt erm&ouml;glicht die Einstellung der Loglevel auf bestimmte Bereiche oder klassenbasiert. 
Ohne besonderen Grund sollte man auch hier nicht unbedingt &uuml;ber den Level FINE einstellen, sonst werden die Logdaten un&uuml;bersichtlich.</P>
<UL>
	<LI>die globale Einstellung des &quot;trace log&quot; Levels, im
	Normalfall ist das WARNING
	<LI>grafische Oberfl&auml;che, hiermit sind alle Programmteile
	eingeschlossen, die mit den Hauptfenstern des Programms zu tun haben
	<LI>Ger&auml;te, hiermit sind alle Programmteile gemeint, die
	&uuml;ber den Ger&auml;tedialog angesprochen werden
	<LI>Datenmodell, beschreibt den Anteil den Programmcodes, der mit
	der internen Datenstruktur zu tun hat
	<LI>allgemeine Funktionen sind die Programmteile die &uuml;berall
	verwendet werden k&ouml;nnen, also Hilfsfunktionen um Kurven zu
	zeichnen, wie die Berechnung einer Checksumme oder die
	Skalierungsteilung von Skalen
	<LI>f&uuml;r die serielle Schnittstelle, &uuml;ber dem Level INFO,
	wird ein Memorylogger verwendet, der den geringsten Laufzeiteinfluss
	hat. Logischerweise steigt dadurch der Speicherverbrauch der Anwendung.
	Im Bedarfsfall kann das Programm dann etwa mit &quot;java -jar -Xmx512m
	DataExplorer.jar&quot; gestartet werden, wobei der maximale
	Speicherverbrauch der Java Virtual Machine auf 512 Megabyte begrenzt
	ist.
</UL>
<P align=center><IMG SRC="images/SettingsDialog_3.png" NAME="SettingsDialog_3" ALIGN=CENTER>
</P>
<P>Der klassenbasierte Loglevel erlaubt den logging Level auf ausgew&auml;hlte Klassen zu reduzieren. 
Hierdurch wir die Ausgabe &uuml;bersichtlicher und erlaubt die Analyse weiter einzuschr&auml;nken.
Die Selektion des Loglevels wir über ein Kontextmen&uuml; erreicht.
Erst durch schließen des Dialogs wird die Einstellung wirksam.
</P>
<P>In jedem Fall werden immer nur drei Tracelogdateien mit einigen
Megabyte Gr&ouml;&szlig;e geschrieben. Die Dateien &uuml;berschreiben
sich dann immer wieder selbst.</P>
<P><B>Hinweis: </B>Im Fehlerfall immer mal wieder einen Blick in das
Logs Verzeichnis werfen, hier k&ouml;nnen wertvolle Hinweise zu f&uuml;r
die Fehleranalyse zu finden sein (siehe <A HREF="HelpInfo_01.html">Verwendete Verzeichnisse</A>).</P>
<P ALIGN=LEFT><A HREF="HelpInfo_02.html">&lt;&lt;== zur&uuml;ck</A></P>
<P ALIGN=RIGHT><A HREF="HelpInfo_2.html">weiter ==&gt;&gt;</A></P>
</DIV>
</BODY>
</HTML>
