<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2//EN">
<!-- 
*************************************************************************************
  	This file is part of GNU DataExplorer.

    GNU DataExplorer is free software: you can redistribute it and/or modify
    it under the terms of the GNU General Public License as published by
    the Free Software Foundation, either version 3 of the License, or
    (at your option) any later version.

    GNU DataExplorer is distributed in the hope that it will be useful,
    but WITHOUT ANY WARRANTY; without even the implied warranty of
    MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
    GNU General Public License for more details.

    You should have received a copy of the GNU General Public License
    along with GNU DataExplorer.  If not, see <http://www.gnu.org/licenses/>.
    
    Copyright (c) 2008,2009,2010,2011,2012,2013 Winfried Bruegmann
************************************************************************************** 
-->
<HTML>
<HEAD>
	<META HTTP-EQUIV="CONTENT-TYPE" CONTENT="text/html; charset=utf-8">
	<TITLE></TITLE>
	<META NAME="GENERATOR" CONTENT="OpenOffice.org 2.4  (Win32)">
	<META NAME="AUTHOR" CONTENT="Winfried Br&uuml;gmann">
	<META NAME="CREATED" CONTENT="20080223;17323053">
	<META NAME="CHANGEDBY" CONTENT="Winfried Br&uuml;gmann">
	<META NAME="CHANGED" CONTENT="20080718;18333165">
	<META NAME="CHANGEDBY" CONTENT="Winfried Brügmann">
	<META NAME="CHANGEDBY" CONTENT="Winfried Brügmann">
</HEAD>
<BODY LANG="de-DE" DIR="LTR">
<DIV TYPE=HEADER>
	<H2><A NAME="einleitung"></A><FONT FACE="Arial"><FONT SIZE=4><I>Der AkkuMaster
	C4 Ger&auml;tedialog Einleitung</I></FONT></FONT></H2>
</DIV>
<P>Der AkkuMaster-C4-Ger&auml;tedialog dient zum Einstellen und
Auslesen von Lade-bzw. Entladevorg&auml;ngen. Es k&ouml;nnen alle vier
Ausg&auml;nge einzeln konfiguriert und bedient werden. Eine
Konfiguration, die das Ger&auml;t &uuml;berlastet, ist nicht m&ouml;glich.
Der aus den anwendungsspezifischen Einstellungen resultierende
Gesamtstrom wird jeweils angezeigt. <BR><B>Hinweis : </B>Ist ein
Auslesevorgang aktiv, kann der Dialog nicht geschlossen werden. 
Es wird ein entsprechender Hinweis in der Statuszeile ausgegeben. 
Da die Anzeige f&uuml;r alle aktiven Ausg&auml;nge laufend aktualisiert
wird, ist eine modales Dialogverhalten nicht ratsam. Sonst ist ein
Umschalten zwischen den Anzeigen der view Kan&auml;le nicht m&ouml;glich.
</P>
<P>Viele Felder sind mit Hilfetexten hinterlegt und sollten diese
Beschreibung f&uuml;r den weiteren Gebrauch weitestgehend &uuml;berfl&uuml;ssig
machen. Die Texte werden durch den dar&uuml;ber gehaltenen Mauszeiger
sichtbar. 
</P>
<H2><FONT FACE="Arial"><FONT SIZE=4><I>Versionsinformation</I></FONT></FONT></H2>
<P>Nachdem die serielle Schnittstelle &uuml;ber den
Ger&auml;teauswahldialog eingestellt ist und der Ger&auml;tedialog
aufgerufen ist, wird der serielle Port im Hintergrund ge&ouml;ffnet und
die Versionsinformation aktualisiert. Das kann zu einem
Kommunikationsfehler f&uuml;hren, wenn der konfigurierte Port nicht
ge&ouml;ffnet werden kann oder das Ger&auml;t ausgeschaltet ist. Ein
Dialog mit der aktuellsten EPROM Version des Herstellers ist im Bild
1 zu sehen. 
</P>
<P ALIGN=CENTER><IMG SRC="HelpInfo_Bild_1.png" NAME="Bild1" ALT="Bild1" ALIGN=BOTTOM WIDTH=440 HEIGHT=590 BORDER=0>
</P>
<H2><FONT FACE="Arial"><FONT SIZE=4><I>Steuerung der Aufnahme</I></FONT></FONT></H2>
<P>Nach der Anwahl eines Ausgangstabulators sind alle nicht ben&ouml;tigten Kn&ouml;pfe inaktiv geschaltet. 
Es bleiben als einzige Auswahlm&ouml;glichkeit 
</P>
<UL>
	<LI>Nur Datenaufnahme 
	<LI><P>Selbst konfiguriertes Programm 
	</P>
</UL>
<P>So ein Zustand ist im Bild 2 zu sehen. 
</P>
<P ALIGN=CENTER><IMG SRC="HelpInfo_Bild_2.png" NAME="Bild2" ALT="Bild2" ALIGN=BOTTOM WIDTH=440 HEIGHT=590 BORDER=0>
</P>
<H3><FONT FACE="Arial"><FONT SIZE=4><I>Nur Datenaufnahme</I></FONT></FONT></H3>
<P>Wenn wie gewohnt am Ger&auml;t der Ladevorgang gestartet wird,
wird durch Auswahl von &quot;Nur Datenaufnahme&quot; die Anzeige im
unteren Bereich mit den aktuell im Ger&auml;t eingestellten Werten
aktualisiert. Au&szlig;erdem wird der &quot;Start&quot;-Knopf aktiviert, um eine
Datenaufnahme zu beginnen (Bild 3). 
</P>
<P ALIGN=CENTER><IMG SRC="HelpInfo_Bild_3.png" NAME="Bild2" ALT="Bild3" ALIGN=BOTTOM WIDTH=440 HEIGHT=590 BORDER=0>
</P>
<P>Wird der &quot;Start&quot;-Kopf gedr&uuml;ckt, aktualisiert sich die grafische
Anzeige zyklisch mit den gemessenen Werten. Der &quot;Stop&quot;-Kopf wird
aktiviert, um die Datenaufnahme gegebenenfalls abzubrechen. 
</P>
<P>Datens&auml;tze werden automatisch beim Wechsel des Programms
angelegt, entladen -&gt; laden. 
</P>
<P>Die Datenaufnahme stoppt automatisch, wenn das Ger&auml;t den
Lade- bzw. Entladevorgang als beendet erkl&auml;rt. 
</P>
<P><B>Hinweis: </B>Ein stoppen der Datenaufnahme <B>stoppt</B> auch,
aus Sicherheitsgr&uuml;nden, das laufende Programm im Ger&auml;t! 
</P>
<H3><FONT FACE="Arial"><FONT SIZE=4><I>Selbst konfiguriertes Programm</I></FONT></FONT></H3>
<P>Wird &quot;Selbst konfiguriertes Programm&quot; angew&auml;hlt,
aktualisiert sich die Anzeige mit den aktuell im Ger&auml;t
eingestellten Werten. <BR>Nun kann man nach eigenen Vorgaben die
Werte &uuml;ber den Dialog ver&auml;ndern. <BR>Da ein Programm, das
im Ger&auml;t ablaufen soll, im EPROM verf&uuml;gbar sein muss, wird
das eingestellte Programm in die eingestellte Speicherstelle
geschrieben. 
</P>
<P><B>Hinweis : </B>Leider ist es nicht m&ouml;glich, &uuml;ber die
Kommunikationsschnittstelle eine Speicherstelle auszuw&auml;hlen und
die dazugeh&ouml;rigen Werte auszulesen. Ich bevorzuge deshalb den
Weg, das Programm am Ger&auml;t selbst einzustellen und &uuml;ber
&quot;Nur Datenaufnahme&quot; die auflaufenden Daten aufzunehmen. 
</P>
<P>W&auml;hlt man nun eine abweichende Speicherstelle aus, wird zur
Verdeutlichung der &Auml;nderung die Hintergrundfarbe f&uuml;r dieses
Feld umgeschaltet. <BR>Bet&auml;tigt man nun den &quot;Start&quot;-Knopf wird das
Programm in die gew&auml;hlte Speicherstelle geschrieben und das
Programm im Ger&auml;t gestartet. So ist es im nachfolgenden Bild
zusehen. 
</P>
<P ALIGN=CENTER><IMG SRC="HelpInfo_Bild_4.png" NAME="Bild2" ALT="Bild4" ALIGN=BOTTOM WIDTH=440 HEIGHT=590 BORDER=0>
</P>
<P>Das Schlie&szlig;en des Dialoges ist nur m&ouml;glich, wenn alle
Datenaufnahmen beendet sind. Dabei wird dann automatisch auch der
serielle Port geschlossen. 
</P>
</BODY>
</HTML>